old_word = "Art"
new_word = "Design"

card = input("Введите карточку товара: ")
new_card = card.replace(old_word, new_word)

print(new_card)

"""
Задание 3: Замена ключевых слов

Описание:

Роман хочет заменить слово "Art" на "Design" в различных описаниях карточек товаров своего магазина.


"""