nummber = float(input("Введите число: "))

print(float(round(nummber)))

"""
Задача 1: Округление

Описание:

Роман заметил, что кассиры много времени тратят на подсчёт мелочи.
 Он решил, что теперь все суммы будут округляться до 0 знаков после запятой. 
 Подрядчик уже реализовал работу кассы, она работает только с дробными числами(float). 
 Теперь нужно добавить функционал округления.

Реализуйте программу, которая будет получать float значения используя функцию input() 
и возвращать float значения округлённые до целого числа
"""