print("Привет, мир!")


"""
Задача 1: “Привет, мир!”

Описание:

Как известно, программисты очень вежливые люди, а вежливость требует первым делом поздороваться!

Реализуйте программу, которая выводит фразу “Привет, мир!”"""
