x = 1

while x <= 5:
    print(x*"*")
    x += 1


"""
Задание 3: Подготовка к новому году! 

Описание:

Роман готовится к новому году! Он решил закупить для своего магазина новогодние ёлки, но ему нравится определённый тип ёлок. Он хочет отправить поставщикам письмо с изображением ёлки. Для автоматизации процесса он просит вас написать программу для принтера, которая будет выводить необходимую ёлку. Вот так она должна выглядеть

“””

*

**

***

****

*****

“””

Реализуйте программу, которая выводит представленную выше фигуру.
"""
